sohil4932/xiaozhi-esp32/main/boards/echoear/EchoEar.cc
    }
    #endif

    uint8_t DetectPcbVersion()
    {
        esp_err_t ret = i2c_master_probe(i2c_bus_, 0x18, 100);
        uint8_t pcb_verison = 0;
        if (ret == ESP_OK) {
            ESP_LOGI(TAG, "PCB verison V1.0");
            pcb_verison = 0;
        } else {
            gpio_config_t gpio_conf = {
                .pin_bit_mask = (1ULL << GPIO_NUM_48),
                .mode = GPIO_MODE_OUTPUT,
                .pull_up_en = GPIO_PULLUP_DISABLE,
                .pull_down_en = GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE
            };
            ESP_ERROR_CHECK(gpio_config(&gpio_conf));
            ESP_ERROR_CHECK(gpio_set_level(GPIO_NUM_48, 1));
            vTaskDelay(pdMS_TO_TICKS(100));
            ret = i2c_master_probe(i2c_bus_, 0x18, 100);
            if (ret == ESP_OK) {
                ESP_LOGI(TAG, "PCB verison V1.2");
                pcb_verison = 1;
                AUDIO_I2S_GPIO_DIN = AUDIO_I2S_GPIO_DIN_2;
                AUDIO_CODEC_PA_PIN = AUDIO_CODEC_PA_PIN_2;
                QSPI_PIN_NUM_LCD_RST = QSPI_PIN_NUM_LCD_RST_2;
                TOUCH_PAD2 = TOUCH_PAD2_2;
                UART1_TX = UART1_TX_2;
                UART1_RX = UART1_RX_2;
            } else {
                ESP_LOGE(TAG, "PCB version detection error");

            }
        }
        return pcb_verison;
    }

    static void touch_isr_callback(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad != nullptr) {
            touchpad->NotifyTouchEvent();
        }
    }

    static void touch_event_task(void* arg)
    {
        Cst816s* touchpad = static_cast<Cst816s*>(arg);
        if (touchpad == nullptr) {
            ESP_LOGE(TAG, "Invalid touchpad pointer in touch_event_task");
            vTaskDelete(NULL);
            return;
        }

        while (true) {
            if (touchpad->WaitForTouchEvent()) {
                auto &app = Application::GetInstance();

                ESP_LOGD(TAG, "Touch event, TP_PIN_NUM_INT: %d", gpio_get_level(TP_PIN_NUM_INT));
                touchpad->UpdateTouchPoint();
                auto touch_event = touchpad->CheckTouchEvent();

                if (touch_event == Cst816s::TOUCH_RELEASE) {
                    app.Schedule([]() {
                        auto& app = Application::GetInstance();
                        auto state = app.GetDeviceState();
                        if (state == kDeviceStateStarting) {
                            auto& board = static_cast<EchoEar&>(Board::GetInstance());
                            board.EnterWifiConfigMode();
                            return;
                        }

                        auto& audio = app.GetAudioService();
                        if (audio.IsOfflineModeEnabled()) {
                            // In offline mode, trigger command listening on touch
                            ESP_LOGI(TAG, "Screen touch: Triggering command listening mode");
                            audio.TriggerCommandListening();
                        } else {
                            // In online mode, toggle chat state
                            app.ToggleChatState();
                        }
                    });
                }
            }
        }
    }

#ifdef IMU_INT_GPIO
    static void imu_isr_callback(void* arg)
    {
        auto* self = static_cast<EchoEar*>(arg);
        if (self && self->imu_isr_mux_ != NULL) {
            BaseType_t xHigherPriorityTaskWoken = pdFALSE;
            xSemaphoreGiveFromISR(self->imu_isr_mux_, &xHigherPriorityTaskWoken);
            portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        }
    }

    static void imu_event_task(void* arg)
    {
        auto* self = static_cast<EchoEar*>(arg);
        if (!self) {
            vTaskDelete(NULL);
            return;
        }

        static constexpr int64_t kImuDebounceUs = 120 * 1000;   // 120ms
        static constexpr int64_t kWiggleWindowUs = 600 * 1000;  // 600ms
        static constexpr int64_t kListeningCooldownUs = 5000 * 1000;  // 5s
        const TickType_t kPollTick = pdMS_TO_TICKS(50);
        int64_t last_motion_us = 0;
        int64_t pending_wiggle_us = 0;
        int64_t last_listen_us = 0;
        bool pending_single = false;

        while (true) {
            int64_t now = esp_timer_get_time();

            if (pending_single && (now - pending_wiggle_us >= kWiggleWindowUs)) {
                pending_single = false;

                if (now - last_listen_us >= kListeningCooldownUs) {
                    auto &app = Application::GetInstance();
                    auto &audio = app.GetAudioService();
                    auto state = app.GetDeviceState();
                    if (state != kDeviceStateListening && state != kDeviceStateConnecting) {
                        ESP_LOGI(TAG, "IMU single-wiggle: entering listening mode");
                        if (audio.IsOfflineModeEnabled()) {
                            audio.TriggerCommandListening();
                        } else {
                            app.StartListening();
                        }
                        last_listen_us = now;
                    }
                }
            }

            if (self->imu_isr_mux_ && xSemaphoreTake(self->imu_isr_mux_, kPollTick) == pdTRUE) {
                now = esp_timer_get_time();
                if (now - last_motion_us < kImuDebounceUs) {
                    continue;
                }
                last_motion_us = now;

                if (!pending_single) {
                    pending_single = true;
                    pending_wiggle_us = now;
                    continue;
                }

                if (now - pending_wiggle_us <= kWiggleWindowUs) {
                    pending_single = false;
                    auto &app = Application::GetInstance();
                    auto state = app.GetDeviceState();
                    if (state == kDeviceStateSpeaking) {
                        ESP_LOGI(TAG, "IMU double-wiggle: stop speaking");
                        app.ToggleChatState();
                    } else if (state == kDeviceStateListening || state == kDeviceStateConnecting) {
                        ESP_LOGI(TAG, "IMU double-wiggle: stop listening");
                        app.StopListening();
                    } else {
                        ESP_LOGI(TAG, "IMU double-wiggle: already idle");
                    }
                } else {
                    pending_wiggle_us = now;
                }
            }
        }
    }
#endif

    void InitializeCharge()
    {
        charge_ = new Charge(i2c_bus_, 0x55);
        xTaskCreatePinnedToCore(Charge::TaskFunction, "batterydecTask", 3 * 1024, charge_, 6, NULL, 0);
    }

    void InitializeCst816sTouchPad()
    {
        cst816s_ = new Cst816s(i2c_bus_, 0x15);

